//Завдання №1
console.log('number' + 23 + 32) // строкове значення додається до двох значень числового типу, 
//приводиться до єдиного формату перші два значення, а потім отримане строкове значення приводить типи до одного типу,  в нашому випадку консоль виведе number2332 (строкове значення)
console.log(41 + 1 + 'number') // результат прикладу наступний 42number, бо перше числове значення додається до другого числового значення та получається 42.
// Потім  чіслове значення 42 приводиться до дного типу даних з 'number'. Результат 42number
console.log(null + 1)// Результат буде дорівнювати 1, бо значення null інформує нас про те, що кормірка пуста
//  ТОму додавши до пустоти 1, отримуємо 1
console.log('five' + + 'two')//використовуються арифметичний унарний оператор Інкремент.
// Даний оператор збільшує на одиницю значенення у разі х++, або зменшує на одиницю у разі ++х. В нашому віпадку строкові типи оперантів. Тому результат fiveNaN 
console.log(2 && 7)// Оператор логічного І. Логічний І (&&) обчислює операнди зліва направо, негайно повертаючись зі значенням першого помилкового операнда, з яким він стикається; якщо всі значення правдиві, повертається значення останнього операнда.Результат буде 7
console.log(+'40' + +'2')//даний оператор конвертує строкове значення в число, а саме 40 та 2. Результат буде дорівнювати 42
console.log('10' - 5 === 6)//Поперше здійснюється аріфметична дія коли строковий операнд приводиться до числового типу та результатом такого виразу буде 5, потім здійснюється функція оператора суворе дорівнює. Оскільки 5 не дорівнює 6, Відподь false  
console.log(true + false)//Логічні операнди true та false, що мають в собі значення 1 та 0 відповідно, додавши ми отримуємо 1
console.log('4px' - 3)// Строковий операнд не може бути виругований бо . Результат NaN
console.log('4' - 3)//Операнди приводяться до одного  типу а саме числового та здійснюється арифметичні обчислення. результат 1
console.log('2' + 3 ** 2)//Поперше здійснюється введення в операнда 3 в ступінь 2. Отримуємо 9. Потім іде приведення до одного типу операндів (строковий тип). Результат 29
console.log(12 / '6')//Перший операнд числовий тип приведення до одного типу, та ділення. Результат 2
console.log(23 + 42 + 'number')// Арифметична дія з двома першими операндами, отримуємо 65. Потім додається до 65 строкове значеення. Результат 65number
console.log('10' + (5 === 6))//Перша дія в душках сувора рівність, результат false, далі строковий операнд та додавання попереднього результату. Результат 10false
console.log('number' + 15 + 3)// Приведення перших оперантів до одного типу строкового, получиться number15, потім додавання останього операнда. Результат number153

//Завдання № 2
console.log(undefined + 1)//Результат NaN
console.log('true' == true)// Результат false. Оператор 
console.log(false == 'false')//Результат false
console.log(null == '')//Результат false
console.log(3 ** (9 / 3))//Результат 27. Перше, це дія у дужках (результат 3), після перший операнд возводиться у ступінь 3
console.log(!!'false' == !!'true')//Результат true
console.log(0 || '0' && 1)//Результат 1
console.log(1 < 2 < 3)//Результат true
console.log('foo'+ + +'bar')//Результат fooNaN
console.log(3 ** 2 / 3)//Результат 3
console.log(1 < 2 > 3)//Результат false
console.log((+null == false) < 1)//Результат false
console.log(false && true || true)//Результат true
console.log(false && (true || true))//Результат false
console.log((+null == false) < 1 ** 5)//Результат false
